app/controllers/api/bank_account_controller.rb

SELECT  `Cuenta`.* FROM `Cuenta`  WHERE `Cuenta`.`id_cuenta` = 1 LIMIT 1
INSERT INTO `Pago` (`detalle`, `email`, `fecha_pago`, `id_cuenta_banco`, `rut_cliente`) VALUES ('asdsd', 'hola@hola.cl', '2014-11-12 04:53:59', 7039959777, '65663892')
---
	def transfer
		uri = URI.parse("http://204.87.169.110/transfer/"+params[:origin].to_s+"/"+params[:destination].to_s+"/"+params[:amount].to_s)
		rollback_uri = URI.parse("http://204.87.169.110/transfer/"+params[:destination].to_s+"/"+params[:origin].to_s+"/"+params[:amount].to_s)
		res = Net::HTTP.get_response(uri)
		if res.code == '200'
			# Transaction successfull
			@pago = Pago.new(pago_params)
			@cuentas = Cuenta.find_by :id_cuenta => params[:bill]
			@pago.cuentas << @cuentas