app/controllers/api/cuenta_controller.rb

SELECT  `Cuenta`.* FROM `Cuenta`  WHERE `Cuenta`.`id_propio_empresa` = '4228392201' LIMIT 1
SELECT `Cuenta`.* FROM `Cuenta`
---
	def index
    	if params[:id_propio_empresa]
			@cuenta = Cuenta.find_by :id_propio_empresa => params[:id_propio_empresa]
		else
			@cuenta = Cuenta.all

SELECT  `Cuenta`.* FROM `Cuenta`  WHERE `Cuenta`.`id_cuenta` = 4 LIMIT 1
---
	def show
		@cuenta = Cuenta.find_by :id_cuenta => params[:id]