app/controllers/api/empresa_controller.rb

SELECT `Empresa`.* FROM `Empresa`
---
	def index
		respond_with Empresa.all

SELECT  `Empresa`.* FROM `Empresa`  WHERE `Empresa`.`id_empresa` = 1 LIMIT 1
---
	def show
		@empresa = Empresa.find_by :id_empresa => params[:id]