app/controllers/api/pago_controller.rb

	def index
		respond_with Pago.all
---
SELECT `Pago`.* FROM `Pago`

	def show
		@pago = Pago.find_by :id_pago => params[:id]
---
SELECT  `Pago`.* FROM `Pago`  WHERE `Pago`.`id_pago` = 1 LIMIT 1