app/controllers/api/rubro_controller.rb

	def index
		respond_with Rubro.all
---
SELECT `Rubro`.* FROM `Rubro`

	def show
		@rubro = Rubro.find_by :id_rubro => params[:id]
---
SELECT  `Rubro`.* FROM `Rubro`  WHERE `Rubro`.`id_rubro` = 1 LIMIT 1