app/controllers/authorization_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'diego.perez.11@alumnos.usm.cl' LIMIT 1
SELECT  `Empresa`.* FROM `Empresa`  WHERE `Empresa`.`id_empresa` = 1 LIMIT 1
---
	def login
		if client_signed_in?
			render :json => current_client, :include => [{:pagos => {:include => [{:cuentas => {:include => [:empresa]}}]}}, :accounts, {:unpaid_bills => {:include => [:empresa]}}], status: :ok
		elsif admin_signed_in?
			render :json => current_admin, :include => [:users, {:companies => {:include => [:company_user]}}] ,status: :ok
		elsif company_user_signed_in?
			render :json => current_company_user, :include => [:cuentas, :pagos] ,status: :ok
		else
			if @user = User.find_by_email(params[:user][:email])
				if @user.valid_password?(params[:user][:password])
					if @user.class.to_s == 'Client'
						sign_in(:client, @user)
						render :json => current_client, :include => [{:pagos => {:include => [{:cuentas => {:include => [:empresa]}}]}}, :accounts, {:unpaid_bills => {:include => [:empresa]}}], status: :ok
					elsif @user.class.to_s == 'Admin'
						sign_in(:admin, @user)
						render :json => current_admin, :include => [:users, {:companies => {:include => [:company_user]}}] ,status: :ok
					else
						@empresa = Empresa.find_by(:id_empresa => @user.id_empresa)

INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `name`, `rut`, `type`, `updated_at`) VALUES ('2014-11-12 19:05:41', 'diego@hola.c', '$2a$10$cfPw.OcLIOS78UPDaujKFu1NaLvSCVn6HkX/hqC/ah/HuVfiZy2ae', 'Diego', '175597859', 'Client', '2014-11-12 19:05:41')
SELECT  `users`.* FROM `users`  WHERE `users`.`type` IN ('Client') AND `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1
---
	def sign_up
		# Normal client registration.
		if params[:user][:type] == 'Client'
			@client = Client.new(client_params)
			if @client.save
				sign_in(:client, @client)
				UserMailer.welcome_email(@client, nil).deliver
				render :json => @client, status: :ok
			else
				render :json => {:errors => @client.errors}, status: :unprocessable_entity
			end
		# Company User registration. Does not follows up with a sign in.
		elsif params[:user][:type] == 'CompanyUser'
			@company_user = CompanyUser.new(company_user_params)
			@company_user.password = Devise.friendly_token[0,10]
			@company_user.password_confirmation = @company_user.password
			if @company_user.save
				UserMailer.welcome_email(@company_user, @company_user.password).deliver
				render :json => @company_user, status: :ok
			else
				@company  = Empresa.find_by(:id_empresa => params[:user][:id_empresa])
				if @company && @company.cuentas.length == 0

UPDATE `users` SET `current_sign_in_at` = '2014-11-28 01:40:58', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_at` = '2014-11-28 01:40:58', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2014-11-28 01:40:58' WHERE `users`.`id` = 14
---
	def set_reset_password_token
		if client_signed_in?
			@user = current_client
		elsif admin_signed_in?
			@user = current_admin
		elsif company_user_signed_in?
			@user = current_company_user
		else
			render :json => {}, status: :unauthorized
		end

		if !@user.reset_password_token
			@user.reset_password_token = Devise.friendly_token[0,20]
			if @user.save